{
    "class_name": "Model",
    "config": {
        "name": "model_1",
        "layers": [
            {
                "name": "input_4",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_4"
                },
                "inbound_nodes": []
            },
            {
                "name": "conv2d_283",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_283",
                    "trainable": false,
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_283",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_283",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_283",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_283",
                "class_name": "Activation",
                "config": {
                    "name": "activation_283",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_283",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_284",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_284",
                    "trainable": false,
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_283",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_284",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_284",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_284",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_284",
                "class_name": "Activation",
                "config": {
                    "name": "activation_284",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_284",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_285",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_285",
                    "trainable": false,
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_284",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_285",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_285",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_285",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_285",
                "class_name": "Activation",
                "config": {
                    "name": "activation_285",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_285",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "max_pooling2d_14",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_14",
                    "trainable": false,
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_285",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_286",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_286",
                    "trainable": false,
                    "filters": 80,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_14",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_286",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_286",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_286",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_286",
                "class_name": "Activation",
                "config": {
                    "name": "activation_286",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_286",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_287",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_287",
                    "trainable": false,
                    "filters": 192,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_286",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_287",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_287",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_287",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_287",
                "class_name": "Activation",
                "config": {
                    "name": "activation_287",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_287",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "max_pooling2d_15",
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_15",
                    "trainable": false,
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_287",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_291",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_291",
                    "trainable": false,
                    "filters": 64,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_15",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_291",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_291",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_291",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_291",
                "class_name": "Activation",
                "config": {
                    "name": "activation_291",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_291",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_289",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_289",
                    "trainable": false,
                    "filters": 48,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_15",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_292",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_292",
                    "trainable": false,
                    "filters": 96,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_291",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_289",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_289",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_289",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_292",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_292",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_292",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_289",
                "class_name": "Activation",
                "config": {
                    "name": "activation_289",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_289",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_292",
                "class_name": "Activation",
                "config": {
                    "name": "activation_292",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_292",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "average_pooling2d_28",
                "class_name": "AveragePooling2D",
                "config": {
                    "name": "average_pooling2d_28",
                    "trainable": false,
                    "pool_size": [
                        3,
                        3
                    ],
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_15",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_288",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_288",
                    "trainable": false,
                    "filters": 64,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_15",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_290",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_290",
                    "trainable": false,
                    "filters": 64,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_289",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_293",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_293",
                    "trainable": false,
                    "filters": 96,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_292",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_294",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_294",
                    "trainable": false,
                    "filters": 32,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_28",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_288",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_288",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_288",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_290",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_290",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_290",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_293",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_293",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_293",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_294",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_294",
                    "trainable": false,
                    "axis": 3,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_294",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_288",
                "class_name": "Activation",
                "config": {
                    "name": "activation_288",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_288",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_290",
                "class_name": "Activation",
                "config": {
                    "name": "activation_290",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_290",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_293",
                "class_name": "Activation",
                "config": {
                    "name": "activation_293",
                    "trainable": false,
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_293",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_294",
